:PROPERTIES:
:ID:       b680a66a-a704-4446-941a-6a8b2f265327
:END:
#+title: 模板全特化
#+filetags: cpp

* 成员函数全特化 [[https://www.learncpp.com/cpp-tutorial/class-template-specialization/][learncpp26.4]]
1. 完全特化的成员函数模板 *不会隐式内联* ，在 =.h= 文件中定义需要 [[id:3e85303c-39c7-4ac3-9d88-a9513d036477][inline]]，以免违反 [[id:c611b7e9-f4e4-4ac4-9a84-fddb01e4275e][ODR(单一定义规则)]]
2. *方法* ：
   1) 显示特化类模板，使用特化类模板中的成员函数 [fn:3]
   2) 仅显式特化成员函数模板 （ *推荐* ）
      #+begin_src cpp :results output :namespaces std :includes <iostream>
      // 原理：Storage<T> --编译器隐式特化--> Storage<double> --仅显式特化--> Storage<double>::print()
      template <typename T>
      class Storage {
      private:
          T m_value {};
      public:
          Storage(T value)
            : m_value { value } {}
          void print() {
              std::cout << m_value << '\n';
          }
      };

      // 显式特化成员函数：编译器会先进行隐式特化
      // 显式特化成员函数 不是 隐式inline的，因此在头文件中时，手动inline
      template<>
      void Storage<double>::print() {
          std::cout << std::scientific << m_value << '\n';
      }
      int main()
      {
          Storage i { 5 };
          Storage d { 6.7 }; // 隐式实例化 Storage<double>

          i.print(); // 调用 Storage<int>::print (由 Storage<T>)
          d.print(); // 调用 Storage<double>::print (调用 显式特化的 Storage<double>::print())
      }
      #+end_src

      #+RESULTS:
      : 5
      : 6.700000e+00








